In [1]:
import pandas as pd

In [2]:
employees = [['donald', 'tom'],
             ['olaf', 'nick'],
             ['jacob', 'juli'],
             ['donald', 'axel'],
             ['olaf', 'henry'],
             ['jacob', 'tomas'],
             ['donald', 'fiona'],
             ['olaf', 'ben'],
             ['jacob', 'shen'],
             ['doanld', 'lora']]

employees = pd.DataFrame(employees, columns=['head', 'employee'])

salaries = [['tom', 2342, '2023-01-14'],
          ['tom', 2345, '2023-03-17'],

          ['nick', 5424, '2022-04-01'],
          ['nick', 5500, '2023-02-30'],

          ['juli', 4566, '2021-04-03'],
          ['juli', 6000, '2024-01-12'],

          ['axel', 12444, '2022-05-17'],
          ['axel', 14000, '2023-11-12'],

          ['henry', 1244, '2021-03-19'],
          ['henry', 7000, '2023-02-09'],

          ['tomas', 2345, '2024-02-02'],
          ['tomas', 4000, '2024-02-09'],

          ['fiona', 1000, '2023-07-31'],
          ['fiona', 1200, '2024-01-29'],

          ['ben', 1244, '2021-12-14'],
          ['ben', 7001, '2023-03-27'],

          ['shen', 6000, '2022-02-18'],
          ['shen', 7001, '2024-01-28'],

          ['lora', 4050, '2023-08-30'],
          ['lora', 7400, '2024-01-19']]

salaries = pd.DataFrame(salaries, columns=['employee', 'salary', 'date'])

In [3]:
salaries.head()

  employee  salary        date
0      tom    2342  2023-01-14
1      tom    2345  2023-03-17
2     nick    5424  2022-04-01
3     nick    5500  2023-02-30
4     juli    4566  2021-04-03

In [4]:
# В списках зарплат сотрудников на разный момент времени
# Оставляем только самые свежие запраты у сотрудников
last_salary = salaries.groupby(['employee'])['date'].transform('max') == salaries['date']
ls = salaries[last_salary]
ls

   employee  salary        date
1       tom    2345  2023-03-17
3      nick    5500  2023-02-30
5      juli    6000  2024-01-12
7      axel   14000  2023-11-12
9     henry    7000  2023-02-09
11    tomas    4000  2024-02-09
13    fiona    1200  2024-01-29
15      ben    7001  2023-03-27
17     shen    7001  2024-01-28
19     lora    7400  2024-01-19

In [5]:
# Находим сотрудника с наибольшей зарплатой
richest = ls[ls.salary == ls.salary.max()]
richest

  employee  salary        date
7     axel   14000  2023-11-12

In [7]:
# Получаем нужную запись и нужно значение
res = employees[employees['employee'] == richest.iloc[0]['employee']]
res['head'].iloc[0]

'donald'